class AddressBook:
    def add(self, request: str) -> str:
        """
        Створює новий запис в адресну книжку за вказаним іменем.
        :param request: str - стрічка, де спочатку обов'язково йде ім'я, а потім одна або декілька інформацій в будь-якому порядку: адреса, номер тлф, email, день народження
        :return: str - виводить (повертає) стрічку з повідомленням користувачу, де каже, що все добре і все добавлено, або вказує, що є помилка і яка.
        """
        pass

    def change(self, request: str) -> str:
        """
        Змінює запис за вказаним іменем в адресній книзі.
        :param request: str - стрічка, де спочатку обов'язково йде ім'я, а потім нова інформація (адреса, номер тлф, email чи день народження)
        :return: str - повертає повідомлення користувачу, де каже, що все добре і змінено, або вказує, що є помилка і яка.
        """
        pass

    def delete(self, request: str) -> str:
        """
        Видаляє запис за вказаним іменем у адресній книзі. Акщо вхідна стрічка містить тільки ім'я, то видаляється все, що збережено за цим іменем.
        :param request: str - стрічка, де спочатку обов'язково ім'я, а потім або інформація, яку треба видалити (адреса, номер тлф, email чи день народження)
        :return: str - повертає повідомлення користувачу, де каже, що все добре і видалено, або вказує, що є помилка і яка.
        """
        pass

    def filter(self, request: str) -> str:
        """
        Шукає інформацію в адресній книзі за співпадінням по введеній стрічці.
        :param request: str - стрічка, за якою виконуємо пошук
        :return: str - повертає стрічку, де записана вся інформаційна лінія (імя, email, тлф, день народження), в якій було співпадіння. Якщо таких ліній декілька, то вони всі
        в стрічці розділені знаком \n. Якщо співпадіння немає, або помилка, то повертає стрічку-повідомлення про це.
        """
        pass

    def show_users_birthday(self, days_number: int) -> str:
        """
        Знаходить користувачів, у яких день народження через задану кількість днів від поточної дати.
        :param days_number: - кількість днів, що додається до поточної дати.
        :return:  - повертаємо стрічку з записом всіх імен користувачів ті їх днів народження, наприклад "ім'я: yyyy-mm-dd, \n ім'я: yyyy-mm-dd, \n...".
        """
        pass


